12/data/attachments/b8708811fc722959.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e6047ca8-1a63-4f76-ad3e-5ec3ea4a7291</nif:username>
            <nif:friendToBeAdded>Richard_low_Friend_71494_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>